AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СообщенияСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СообщенияСМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Comment>Текст сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона получателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Описание ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСЕмаилСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСЕмаилСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СообщениеSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СообщениеSMS</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКогдаОтправить</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереносСрокаПоФЗ230</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКонтакта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КакСвязаться</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСообщенияSMS</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КонтрольСобытий/Ext/Module.bsl
Функция РезультативныеЗвонки(Должник) Экспорт
	
	КоличествоЗвонковДень = Константы.ЗвонкиДень.Получить();
	КоличествоЗвонковМесяц = Константы.ЗвонкиМесяц.Получить();
	КоличествоЗвонковНеделя = Константы.ЗвонкиНеделя.Получить();
	//Проверяем количество за день
	Если Константы.КоличествоРезультативныхЗвонков.Получить() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК ЧислоРезультативных
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	Мероприятие.ДатаВыполнения > &НачалоДня
		|	И (Мероприятие.Объект = &Должник
		|			ИЛИ Мероприятие.Объект.Должник = &Должник)
		|	И Мероприятие.Выполнена = ИСТИНА
		|	И Мероприятие.ПометкаУдаления = ЛОЖЬ
		|	И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА");	
		Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Должник", Должник);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Если Результат.ЧислоРезультативных = КоличествоЗвонковДень
				ИЛИ Результат.ЧислоРезультативных > КоличествоЗвонковДень Тогда
				Сообщить("Количество контактов сегодня больше "+КоличествоЗвонковДень+"!");
				Возврат Истина;
			Иначе
			КонецЕсли;
		Иначе
		КонецЕсли;
		
		//Затем количество за неделю
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК ЧислоРезультативных
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	Мероприятие.ДатаВыполнения > &НачалоНедели
		|	И (Мероприятие.Объект = &Должник
		|			ИЛИ Мероприятие.Объект.Должник = &Должник)
		|	И Мероприятие.Выполнена = ИСТИНА
		|	И Мероприятие.ПометкаУдаления = ЛОЖЬ
		|	И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА");	
		Запрос.УстановитьПараметр("НачалоНедели", НачалоНедели(ТекущаяДата()));
		Запрос.УстановитьПараметр("Должник", Должник);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Если Результат.ЧислоРезультативных = КоличествоЗвонковНеделя
				ИЛИ Результат.ЧислоРезультативных > КоличествоЗвонковНеделя Тогда
                Сообщить("Количество контактов на этой неделе больше "+КоличествоЗвонковНеделя+"!");
				Возврат Истина;
			Иначе
			КонецЕсли;
		Иначе
		КонецЕсли;
		//Затем количество за месяц
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК ЧислоРезультативных
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	Мероприятие.ДатаВыполнения > &НачалоМесяца
		|	И (Мероприятие.Объект = &Должник
		|			ИЛИ Мероприятие.Объект.Должник = &Должник)
		|	И Мероприятие.Выполнена = ИСТИНА
		|	И Мероприятие.ПометкаУдаления = ЛОЖЬ
		|	И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА");	
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("Должник", Должник);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Если Результат.ЧислоРезультативных = КоличествоЗвонковМесяц
				ИЛИ Результат.ЧислоРезультативных > КоличествоЗвонковМесяц Тогда
				Сообщить("Количество контактов в этом месяце больше "+КоличествоЗвонковМесяц+"!");
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;		
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция РезультативныеЗвонкиМесяц(Должник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Мероприятие.Ссылка) КАК ЧислоРезультативных
	|ИЗ
	|	Задача.Мероприятие КАК Мероприятие
	|ГДЕ
	|	Мероприятие.ДатаВыполнения > &НачалоМесяца
	|	И Мероприятие.Объект = &Должник
	|	И Мероприятие.Выполнена = ИСТИНА
	|	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	|	И Мероприятие.Результат.РезультативныйКонтакт = ИСТИНА");	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Должник", Должник);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.ЧислоРезультативных = 8
			ИЛИ Результат.ЧислоРезультативных > 8 Тогда
			Сообщить("Количество контактов в этом месяце больше "+Результат.ЧислоРезультативных+"!");
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ЗапретЗвонка(ЗапретЗвонка, НачалоЗапретаЗвонка, КонецЗапретаЗвонка) Экспорт
	Если ЗапретЗвонка И НачалоЗапретаЗвонка < ТекущаяДата() И КонецЗапретаЗвонка > ТекущаяДата() И ЗначениеЗаполнено(НачалоЗапретаЗвонка) И ЗначениеЗаполнено(КонецЗапретаЗвонка) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция КонтрольЧасовогоПояса(Должник) Экспорт
	Если Константы.ЧасовойПоясЗвонка.Получить() Тогда
		Если Не ЗначениеЗаполнено(Должник.ЧасовойПояс) Тогда
			Сообщить("Не заполнен часовой пояс должника!");
			Возврат Истина;
		КонецЕсли;
		
		УниверсальноеВремя = УниверсальноеВремя(ТекущаяДата(), Константы.ЧасовойПояс.Получить());
		
		ОшибочныйОтрицательныйПояс = ПоискОшибочногоПояса(Должник.ЧасовойПояс);
		Если ОшибочныйОтрицательныйПояс и НЕ Должник.ЧасовойПояс = "EET" Тогда
			МестноеВремя = МестноеВремя(УниверсальноеВремя, Должник.ЧасовойПояс);// минус еще один час
			Пересчет = МестноеВремя - 3600;
			МестноеВремя = Пересчет; 
		ИначеЕсли НЕ ОшибочныйОтрицательныйПояс и Должник.ЧасовойПояс = "EET" Тогда
			// Поменять CET на EET, иначе с 9:00 по 10:00 звонить нельзя
			ЧП = "EET";
			МестноеВремя = МестноеВремя(УниверсальноеВремя, ЧП);
		ИначеЕсли НЕ ОшибочныйОтрицательныйПояс и НЕ Должник.ЧасовойПояс = "EET" Тогда
			МестноеВремя = МестноеВремя(УниверсальноеВремя, Должник.ЧасовойПояс);
		КонецЕсли;	
		
		Интервал = Новый Структура;
		Интервал.Вставить("ВремяОт");
		Интервал.Вставить("ВремяДо");
		ЗаполнитьИнтервал(МестноеВремя,Интервал);
		//Если Формат(МестноеВремя, "ДЛФ=В")< Формат(Интервал.ВремяОт,"ДЛФ=В") или Формат(МестноеВремя, "ДЛФ=В")> Формат(Интервал.ВремяДо,"ДЛФ=В") тогда
		Если МестноеВремя < Интервал.ВремяОт или МестноеВремя > Интервал.ВремяДо Тогда
			Сообщить("Запрещенное время взаимодействия!");
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ДоступностьДанных(ДО) Экспорт
	Если РольДоступна("Оператор") И Не РольДоступна("тсАдминистрирование") И Не РольДоступна("ПолныеПрава") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Сотрудник = &Сотрудник
		|	И ОбъектыВРаботеОстатки.Объект = &Объект");	
		Запрос.УстановитьПараметр("Объект", ДО);
		Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.ТекущийПользователь);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции

Процедура ЗаполнитьИнтервал(МестноеВремя, Интервал) Экспорт
	Если ДеньНедели(МестноеВремя) = 6 или ДеньНедели(МестноеВремя) = 7 Тогда
		ВремяОт = Константы.ВыходныеВремяОт.Получить();
		ВремяДо = Константы.ВыходныеВремяДо.Получить();
		//Выходной
	Иначе
		//Будний
		ВремяОт = Константы.БудниВремяОт.Получить();
		ВремяДо = Константы.БудниВремяДо.Получить();
	КонецЕсли;
	
	МестноеВремяДень = НачалоДня(МестноеВремя);
	Интервал.ВремяОт = МестноеВремяДень + (ВремяОт - НачалоДня(ВремяОт));
	Интервал.ВремяДо = МестноеВремяДень + (ВремяДо - НачалоДня(ВремяДо));
	
КонецПроцедуры

Функция ПоискОшибочногоПояса(ЧП) Экспорт
	Массив = Новый Массив;
	Массив.Добавить("GMT-01:00");
	Массив.Добавить("GMT-06:00");
	Массив.Добавить("GMT-07:00");
	Массив.Добавить("GMT-08:00");
	Массив.Добавить("GMT-10:00");	
	Для Каждого Представление из Массив Цикл 
		Если СтрНайти(Представление,ПредставлениеЧасовогоПояса(ЧП),,,) > 0 Тогда
			Возврат Истина;
			Прервать;
		Иначе
			Продолжить;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;	
КонецФункции

Функция КонтрольСМС(Должник) Экспорт
	//Изм. Лебедева 14.10.2019
	
	КоличествоСМСДень = Константы.СообщенияДень.Получить();
	КоличествоСМСНеделя = Константы.СообщенияНеделя.Получить();
	КоличествоСМСМесяц = Константы.СообщенияМесяц.Получить();
	//И (Мероприятие.Объект = &Должник
	//	|			ИЛИ Мероприятие.Объект.Должник = &Должник
	
	Если Константы.КоличествоСМС.Получить() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоДня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID)
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Отправлено = ИСТИНА
		|	И РСЕмаилСообщения.Объект.Должник = &Объект
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоДня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоДня");
		Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Объект",Должник);
		Результат = Запрос.Выполнить().Выбрать();
		//Если Результат.Следующий() Тогда
		//	Если Результат.КоличествоСообщений > КоличествоСМСДень-1 Тогда
		//		Сообщить("Число сообщений сегодня больше "+КоличествоСМСДень+"!");
		//		Возврат Истина;
		//	Иначе
		//	КонецЕсли;
		//Иначе
		//	
		//КонецЕсли;
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений = КоличествоСМСДень Тогда
				Сообщить("Количество СМС сегодня больше "+КоличествоСМСДень+"!");
				Возврат Истина;
			Иначе
			КонецЕсли;
		КонецЦикла;	
		
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоНедели
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID)
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Отправлено = ИСТИНА
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоНедели
		|	И РСЕмаилСообщения.Объект.Должник = &Объект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоНедели");
		Запрос.УстановитьПараметр("НачалоНедели",НачалоНедели(ТекущаяДата()));
		Запрос.УстановитьПараметр("Объект",Должник);
		Результат = Запрос.Выполнить().Выбрать();
		//Если Результат.Следующий() Тогда
		//	Если Результат.КоличествоСообщений > КоличествоСМСНеделя-1 Тогда
		//		Сообщить("Число сообщений на этой неделе больше "+КоличествоСМСНеделя+"!");
		//		Возврат Истина;
		//	Иначе
		//	КонецЕсли;
		//Иначе
		//КонецЕсли;
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений = КоличествоСМСНеделя Тогда
				Сообщить("Количество СМС на этой неделе больше "+КоличествоСМСНеделя+"!");
				Возврат Истина;
			Иначе
			КонецЕсли;
		КонецЦикла;
		
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений,
		|	NULL КАК Ссылка
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоМесяца
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID),
		|	NULL
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Объект.Должник = &Объект
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоМесяца
		|	И РСЕмаилСообщения.Отправлено = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоМесяца");
		Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("Объект",Должник);
		Результат = Запрос.Выполнить().Выбрать();
		//Если Результат.Следующий() Тогда
		//	Если Результат.КоличествоСообщений > КоличествоСМСМесяц-1 Тогда
		//		Сообщить("Число сообщений в этом месяце больше "+КоличествоСМСМесяц+"!");
		//		Возврат Истина;
		//	Иначе
		//		Возврат Ложь;
		//	КонецЕсли;
		//Иначе
		//	Возврат Ложь;
		//КонецЕсли;
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений = КоличествоСМСМесяц Тогда
				Сообщить("Количество СМС в этом месяце больше "+КоличествоСМСМесяц+"!");
				Возврат Истина;
				Прервать;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция КонтрольСМС230ФЗ(Должник,ДатаСМС) Экспорт
	
	ДатаСМС = ?(ЗначениеЗаполнено(ДатаСМС),ДатаСМС,ТекущаяДата());
	УниверсальнаяДата = УниверсальноеВремя(ДатаСМС, Константы.ЧасовойПояс.Получить()); 
	СмещениеОтСтандартногоВремени = СмещениеСтандартногоВремени(Должник.ЧасовойПояс, УниверсальнаяДата);
	ДатаСМСДолжника = УниверсальнаяДата + СмещениеОтСтандартногоВремени; 
	
	Структура = КонтрольСМСПоКоличеству(Должник,ДатаСМСДолжника,Новый Структура);
	Если Структура.Свойство("Ошибка") Тогда
		Возврат Структура;
	ИначеЕсли Структура.Свойство("НеФЗ230") Тогда
		Структура.Вставить("ДатаКогдаОтправить",ДатаСМС);
		Структура.Вставить("ДатаАктуальностиОтправки",Дата(1,1,1));
		Возврат Структура;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
		ПараметрыПолучения.ПолучатьПредшествующие = Ложь;
		ПараметрыПолучения.ВызыватьИсключение = Ложь;
		мДатаСМС = Новый Массив;
		мДатаСМС.Добавить(ДатаСМСДолжника);
		ДниКалендаря = КалендарныеГрафики.БлижайшиеРабочиеДаты(Справочники.ПроизводственныеКалендари.ФЗ230, мДатаСМС, ПараметрыПолучения);
		УстановитьПривилегированныйРежим(Ложь);	
		НачалоДняДатаСМС = НачалоДня(ДатаСМСДолжника); 
		БудниВремяОт = Константы.БудниВремяОт.Получить();
		БудниВремяДо = Константы.БудниВремяДо.Получить()-1;
		ВыходныеВремяОт = Константы.ВыходныеВремяОт.Получить();
		ВыходныеВремяДо = Константы.ВыходныеВремяДо.Получить()-1;
		ПустаяДата = Дата(1,1,1);
		//Если день будний и не праздничный
		Если НачалоДняДатаСМС = ДниКалендаря.Получить(НачалоДняДатаСМС) Тогда
			//Если дата СМС совпадает с интервалом
			Если ДатаСМСДолжника > НачалоДняДатаСМС + (БудниВремяОт - ПустаяДата) И ДатаСМСДолжника < НачалоДняДатаСМС + (БудниВремяДо - ПустаяДата) Тогда
				Структура.Вставить("ДатаКогдаОтправить",?(ДатаСМСДолжника<ТекущаяДата(),ТекущаяДата(),ДатаСМСДолжника)); //если попали сегодня в интервал, но время раньше текущего 
				Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМС + (БудниВремяДо - ПустаяДата));
				Возврат Структура;
			//Если время выподает на утро до начала обзвона
			ИначеЕсли  ДатаСМСДолжника < НачалоДняДатаСМС + (БудниВремяОт - ПустаяДата) И ДатаСМСДолжника < НачалоДняДатаСМС + (БудниВремяДо - ПустаяДата) Тогда
				Структура.Вставить("ДатаКогдаОтправить",НачалоДняДатаСМС + (БудниВремяОт - ПустаяДата));
				Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМС + (БудниВремяДо - ПустаяДата));
				Возврат Структура;
			//Переносим смс на завтра
			Иначе
				Структура = КонтрольСМС230ФЗПереносНаЗавтра(НачалоДняДатаСМС + 86400,Структура);	
				Возврат Структура;
			КонецЕсли;
		//Иначе день праздничный или выходной	
		Иначе
			//Если дата СМС совпадает с интервалом
			Если ДатаСМСДолжника > НачалоДняДатаСМС + (ВыходныеВремяОт - ПустаяДата) И ДатаСМСДолжника < НачалоДняДатаСМС + (ВыходныеВремяДо - ПустаяДата) Тогда
				Структура.Вставить("ДатаКогдаОтправить",ДатаСМСДолжника);
				Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМС + (ВыходныеВремяДо - ПустаяДата));
				Возврат Структура;
			//Если время выподает на утро до начала обзвона
			ИначеЕсли  ДатаСМСДолжника < НачалоДняДатаСМС + (ВыходныеВремяОт - ПустаяДата) И ДатаСМСДолжника < НачалоДняДатаСМС + (ВыходныеВремяДо - ПустаяДата) Тогда
				Структура.Вставить("ДатаКогдаОтправить",НачалоДняДатаСМС + (ВыходныеВремяОт - ПустаяДата));
				Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМС + (ВыходныеВремяДо - ПустаяДата));
				Возврат Структура;
			//Переносим смс на завтра
			Иначе
				Структура = КонтрольСМС230ФЗПереносНаЗавтра(НачалоДняДатаСМС + 86400,Структура);	
				ВОзврат Структура;
			КонецЕсли;
		КонецЕсли;
		КонецЕсли;
	Возврат Структура;
	
КонецФункции // КонтрольСМС230ФЗ()

Функция КонтрольСМС230ФЗПереносНаЗавтра(ДатаСМСДолжника,Структура)
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
	ПараметрыПолучения.ПолучатьПредшествующие = Ложь;
	ПараметрыПолучения.ВызыватьИсключение = Ложь;
	мДатаСМС = Новый Массив;
	мДатаСМС.Добавить(ДатаСМСДолжника);
	ДниКалендаря = КалендарныеГрафики.БлижайшиеРабочиеДаты(Справочники.ПроизводственныеКалендари.ФЗ230, мДатаСМС, ПараметрыПолучения);
	УстановитьПривилегированныйРежим(Ложь);	
	НачалоДняДатаСМСДолжника = НачалоДня(ДатаСМСДолжника); 
	БудниВремяОт = Константы.БудниВремяОт.Получить();
	БудниВремяДо = Константы.БудниВремяДо.Получить()-1;
	ВыходныеВремяОт = Константы.ВыходныеВремяОт.Получить();
	ВыходныеВремяДо = Константы.ВыходныеВремяДо.Получить()-1;
	ПустаяДата = Дата(1,1,1);
	//Если день будний и не праздничный
	Если НачалоДняДатаСМСДолжника = ДниКалендаря.Получить(НачалоДняДатаСМСДолжника) Тогда
		Структура.Вставить("ДатаКогдаОтправить",НачалоДняДатаСМСДолжника + (БудниВремяОт - ПустаяДата));
		Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМСДолжника + (БудниВремяДо - ПустаяДата));
		Возврат Структура;
	//Иначе день праздничный или выходной
	Иначе
		Структура.Вставить("ДатаКогдаОтправить",НачалоДняДатаСМСДолжника + (ВыходныеВремяОт - ПустаяДата));
		Структура.Вставить("ДатаАктуальностиОтправки",НачалоДняДатаСМСДолжника + (ВыходныеВремяДо - ПустаяДата));
		Возврат Структура;		
	КонецЕсли;
КонецФункции

Функция КонтрольСМСПоКоличеству(Должник,ДатаСМС,Структура) Экспорт
	КоличествоСМСДень = Константы.СообщенияДень.Получить();
	КоличествоСМСНеделя = Константы.СообщенияНеделя.Получить();
	КоличествоСМСМесяц = Константы.СообщенияМесяц.Получить();
	мСостояниеСообщения = Новый Массив;
	мСостояниеСообщения.Добавить(Перечисления.СостоянияСообщенияSMS.Исходящее);
	мСостояниеСообщения.Добавить(Перечисления.СостоянияСообщенияSMS.Доставлено);
	мСостояниеСообщения.Добавить(Перечисления.СостоянияСообщенияSMS.ОтправленоПровайдером);
	мСостояниеСообщения.Добавить(Перечисления.СостоянияСообщенияSMS.ОтправляетсяПровайдером);

	Если Константы.КоличествоСМС.Получить() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоДня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID)
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Отправлено = ИСТИНА
		|	И РСЕмаилСообщения.Объект.Должник = &Объект
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоДня
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоДня
		|	И СообщениеSMSАдресаты.СостояниеСообщения В(&СостояниеСообщения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Количество.КоличествоСообщений) КАК КоличествоСообщений
		|ИЗ
		|	ВТ_Количество КАК ВТ_Количество");
		Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ДатаСМС));
		Запрос.УстановитьПараметр("Объект",Должник);
		Запрос.УстановитьПараметр("СостояниеСообщения",мСостояниеСообщения);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений > КоличествоСМСДень-1 Тогда
				Структура.Вставить("Ошибка","Количество СМС сегодня больше "+КоличествоСМСДень+"!");
				Структура.Вставить("КоличествоДней",Ложь);
				Возврат Структура;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоНедели
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID)
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Отправлено = ИСТИНА
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоНедели
		|	И РСЕмаилСообщения.Объект.Должник = &Объект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоНедели
		|	И СообщениеSMSАдресаты.СостояниеСообщения В(&СостояниеСообщения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Количество.КоличествоСообщений) КАК КоличествоСообщений
		|ИЗ
		|	ВТ_Количество КАК ВТ_Количество");
		Запрос.УстановитьПараметр("НачалоНедели",НачалоНедели(ДатаСМС));
		Запрос.УстановитьПараметр("Объект",Должник);
		Запрос.УстановитьПараметр("СостояниеСообщения",мСостояниеСообщения);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений > КоличествоСМСНеделя-1 Тогда
				Структура.Вставить("Ошибка","Количество СМС на этой неделе больше "+КоличествоСМСНеделя+"!");
				Структура.Вставить("КоличествоНеделя",Ложь);
				Возврат Структура;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщенияСМС.GUID) КАК КоличествоСообщений
		|ПОМЕСТИТЬ ВТ_Количество
		|ИЗ
		|	РегистрСведений.СообщенияСМС КАК СообщенияСМС
		|ГДЕ
		|	СообщенияСМС.Входящее = ЛОЖЬ
		|	И (СообщенияСМС.Объект = &Объект
		|			ИЛИ СообщенияСМС.Объект.Должник = &Объект)
		|	И СообщенияСМС.Дата > &НачалоМесяца
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РСЕмаилСообщения.GUID)
		|ИЗ
		|	РегистрСведений.РСЕмаилСообщения КАК РСЕмаилСообщения
		|ГДЕ
		|	РСЕмаилСообщения.Объект.Должник = &Объект
		|	И РСЕмаилСообщения.ДатаОтправки > &НачалоМесяца
		|	И РСЕмаилСообщения.Отправлено = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СообщениеSMSАдресаты.Ссылка)
		|ИЗ
		|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
		|ГДЕ
		|	СообщениеSMSАдресаты.Контакт.Должник = &Объект
		|	И СообщениеSMSАдресаты.Ссылка.Дата > &НачалоМесяца
		|	И СообщениеSMSАдресаты.СостояниеСообщения В(&СостояниеСообщения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Количество.КоличествоСообщений) КАК КоличествоСообщений
		|ИЗ
		|	ВТ_Количество КАК ВТ_Количество");
		Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(ДатаСМС));
		Запрос.УстановитьПараметр("Объект",Должник);
		Запрос.УстановитьПараметр("СостояниеСообщения",мСостояниеСообщения);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.КоличествоСообщений > КоличествоСМСМесяц-1 Тогда
				Структура.Вставить("Ошибка","Количество СМС в этом месяце больше "+КоличествоСМСМесяц+"!");
				Структура.Вставить("КоличествоМесяц",Ложь);
				Возврат Структура;
			Иначе
				Возврат Структура;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Структура.Вставить("НеФЗ230",Истина);;
		Возврат Структура;
	КонецЕсли;	
КонецФункции
